Repository: KoukeNeko/Hamasen
Catalog: HamasenCore/Sources/HamasenCore/Localizable.xcstrings
Source language: zxx
Languages: en, ja, ko, zh_hans

source: %@ 不支援 SSH 金鑰認證，請改用密碼
en: %@ does not support SSH key authentication. Use a password instead.
ja: %@はSSH鍵認証に対応していません。パスワードをお使いください。
ko: %@에서는 SSH 키 인증을 지원하지 않습니다. 암호를 사용하십시오.
zh_hans: %@ 不支持 SSH 密钥认证，请改用密码

source: %@ 失敗（%@）：%@
en: %1$@ failed (%2$@): %3$@
ja: %1$@に失敗しました（%2$@）：%3$@
ko: %1$@ 실패(%2$@): %3$@
zh_hans: %1$@ 失败（%2$@）：%3$@

source: %@ 失敗（%@）：沒有權限
en: %1$@ failed (%2$@): permission denied
ja: %1$@に失敗しました（%2$@）：権限がありません
ko: %1$@ 실패(%2$@): 권한이 없습니다
zh_hans: %1$@ 失败（%2$@）：没有权限

source: %@ 的主機金鑰和上次不同，連線已中止。可能是伺服器重建過，也可能有人冒充它。核對伺服器端的指紋後，到該伺服器的設定中清除已記錄的金鑰。已記錄：%@，這次收到：%@
en: The host key for %1$@ is not the one recorded, so the connection was refused. The server may have been rebuilt, or something may be answering in its place. Check the fingerprint on the server itself, then clear the recorded key in that server’s settings. Recorded: %2$@, received: %3$@
ja: %1$@のホスト鍵が記録と異なるため接続を中止しました。サーバが再構築された可能性も、第三者がなりすましている可能性もあります。サーバ側でフィンガープリントを確認してから、そのサーバの設定で記録済みの鍵を消去してください。記録：%2$@、今回：%3$@
ko: %1$@의 호스트 키가 기록된 키와 달라 연결을 중단했습니다. 서버가 재구축되었거나 누군가 서버를 사칭하고 있을 수 있습니다. 서버에서 직접 지문을 확인한 다음 해당 서버의 설정에서 기록된 키를 지우십시오. 기록됨: %2$@, 수신됨: %3$@
zh_hans: %1$@ 的主机密钥与上次不同，连接已中止。可能是服务器重建过，也可能有人冒充它。核对服务器端的指纹后，到该服务器的设置中清除已记录的密钥。已记录：%2$@，这次收到：%3$@

source: Google 雲端硬碟
en: Google Drive
ja: Google ドライブ
ko: Google 드라이브
zh_hans: Google 云端硬盘

source: Hamasen 目前沒有掛載中的位置
en: Hamasen has no mounted location right now
ja: 現在マウント中の場所がありません
ko: Hamasen에 현재 마운트된 위치가 없습니다
zh_hans: Hamasen 目前没有已挂载的位置

source: Keychain 憑證格式無法辨識
en: The Keychain item is in an unrecognized format
ja: キーチェーン項目の形式を認識できません
ko: 키체인 항목의 형식을 인식할 수 없습니다
zh_hans: 钥匙串项目格式无法识别

source: Keychain 操作失敗（%d: %@）
en: Keychain operation failed (%1$d: %2$@)
ja: キーチェーンの操作に失敗しました（%1$d: %2$@）
ko: 키체인 작업에 실패했습니다(%1$d: %2$@)
zh_hans: 钥匙串操作失败（%1$d: %2$@）

source: SSH 金鑰
en: SSH Key
ja: SSH鍵
ko: SSH 키
zh_hans: SSH 密钥

source: 「%@」已暫停，繼續後才會同步
en: “%@” is paused and will not sync until resumed
ja: 「%@」は一時停止中です。再開するまで同期されません。
ko: “%@” 연결은 일시 정지되었습니다. 재개할 때까지 동기화되지 않습니다.
zh_hans: “%@”已暂停，恢复后才会同步

source: 上傳
en: Upload
ja: アップロード
ko: 업로드
zh_hans: 上传

source: 下載
en: Download
ja: ダウンロード
ko: 다운로드
zh_hans: 下载

source: 下載區間
en: Range download
ja: 範囲のダウンロード
ko: 범위 다운로드
zh_hans: 范围下载

source: 不支援的金鑰類型：%@（目前支援 Ed25519 與 RSA）
en: Unsupported key type: %@ (Ed25519 and RSA are supported)
ja: サポートされていない鍵の種類：%@（Ed25519とRSAに対応しています）
ko: 지원되지 않는 키 유형: %@(Ed25519 및 RSA를 지원합니다)
zh_hans: 不支持的密钥类型：%@（目前支持 Ed25519 与 RSA）

source: 不限制
en: Unlimited
ja: 制限なし
ko: 제한 없음

source: 主機名稱
en: Hostname
ja: ホスト名
ko: 호스트 이름
zh_hans: 主机名

source: 列出目錄
en: Directory listing
ja: ディレクトリの一覧取得
ko: 디렉터리 목록 조회
zh_hans: 列出目录

source: 刪除
en: Delete
ja: 削除
ko: 삭제
zh_hans: 删除

source: 刪除 %lld 個
en: %lld deleted
ja: %lld 件削除
ko: %lld개 삭제
zh_hans: 删除 %lld 个

source: 刪除了 %@
en: Deleted %@
ja: %@ が削除されました
ko: %@ 삭제됨
zh_hans: 删除了 %@

source: 刪除檔案
en: File deletion
ja: ファイルの削除
ko: 파일 삭제
zh_hans: 删除文件

source: 刪除目錄
en: Directory deletion
ja: ディレクトリの削除
ko: 디렉터리 삭제
zh_hans: 删除目录

source: 密碼
en: Password
ja: パスワード
ko: 암호
zh_hans: 密码

source: 密碼不正確，或這個檔案已損毀
en: The passphrase is wrong, or this file has been damaged
ja: パスワードが違うか、このファイルは壊れています
ko: 암호가 올바르지 않거나 이 파일이 손상되었습니다
zh_hans: 密码不正确，或此文件已损坏

source: 尚未設定 %@ 的用戶端 ID，請到「設定 › 雲端服務」填寫
en: The Client ID for %@ is not set. Enter it in “Settings › Cloud Services”.
ja: %@のクライアント ID が設定されていません。「設定 › クラウドサービス」で入力してください。
ko: %@의 클라이언트 ID가 설정되지 않았습니다. “설정 › 클라우드 서비스”에서 입력하십시오.
zh_hans: 尚未设置 %@ 的客户端 ID，请前往“设置 › 云服务”填写

source: 尚未連線到伺服器
en: Not connected to the server
ja: サーバに接続していません
ko: 서버에 연결되어 있지 않습니다
zh_hans: 尚未连接到服务器

source: 已取消登入
en: Sign-in canceled
ja: サインインがキャンセルされました
ko: 로그인이 취소되었습니다
zh_hans: 已取消登录

source: 建立目錄
en: Directory creation
ja: ディレクトリの作成
ko: 디렉터리 생성
zh_hans: 创建目录

source: 建立資料夾
en: Create folder
ja: フォルダの作成
ko: 폴더 생성
zh_hans: 创建文件夹

source: 找不到 Keychain 憑證
en: No such Keychain item
ja: キーチェーン項目が見つかりません
ko: 키체인 항목을 찾을 수 없습니다
zh_hans: 找不到钥匙串项目

source: 找不到遠端項目：%@
en: No such item on the server: %@
ja: サーバに項目が見つかりません：%@
ko: 서버에서 항목을 찾을 수 없습니다: %@
zh_hans: 找不到远程项目：%@

source: 搜尋
en: Search
ja: 検索
ko: 검색
zh_hans: 搜索

source: 新增 %lld 個
en: %lld added
ja: %lld 件追加
ko: %lld개 추가됨
zh_hans: 新增 %lld 个

source: 新增了 %@
en: Added %@
ja: %@ が追加されました
ko: %@ 추가됨

source: 更新 %lld 個
en: %lld updated
ja: %lld 件更新
ko: %lld개 업데이트됨
zh_hans: 更新 %lld 个

source: 更新了 %@
en: Updated %@
ja: %@ が更新されました
ko: %@ 업데이트됨

source: 瀏覽器登入
en: Browser Sign-In
ja: ブラウザでサインイン
ko: 브라우저 로그인
zh_hans: 浏览器登录

source: 無法從密碼推導金鑰
en: Could not derive a key from the passphrase
ja: パスワードから鍵を導出できませんでした
ko: 암호에서 키를 도출할 수 없습니다
zh_hans: 无法从密码推导密钥

source: 無法接收登入結果：%@
en: Could not receive the sign-in result: %@
ja: サインインの結果を受信できませんでした：%@
ko: 로그인 결과를 받을 수 없습니다: %@
zh_hans: 无法接收登录结果：%@

source: 無法確認伺服器身分，連線已中止：%@
en: The server’s identity could not be checked, so the connection was refused: %@
ja: サーバの身元を確認できないため接続を中止しました：%@
ko: 서버의 신원을 확인할 수 없어 연결을 중단했습니다: %@
zh_hans: 无法确认服务器身份，连接已中止：%@

source: 無法讀取 SSH 金鑰（金鑰密碼可能有誤）：%@
en: Could not read the SSH key (the passphrase may be wrong): %@
ja: SSH鍵を読み込めませんでした（パスフレーズが違う可能性があります）：%@
ko: SSH 키를 읽을 수 없습니다(키 암호가 올바르지 않을 수 있습니다): %@
zh_hans: 无法读取 SSH 密钥（密钥密码可能有误）：%@

source: 無法讀取本地檔案：%@
en: Could not read the local file: %@
ja: ローカルファイルを読み込めませんでした：%@
ko: 로컬 파일을 읽을 수 없습니다: %@
zh_hans: 无法读取本地文件：%@

source: 無法連線到伺服器
en: Could not connect to the server
ja: サーバに接続できませんでした
ko: 서버에 연결할 수 없습니다
zh_hans: 无法连接到服务器

source: 無法連線到伺服器：%@
en: Could not connect to the server: %@
ja: サーバに接続できませんでした：%@
ko: 서버에 연결할 수 없습니다: %@
zh_hans: 无法连接到服务器：%@

source: 登入回應與這次的要求不符，請重新登入
en: The sign-in response does not match this request. Sign in again.
ja: サインインの応答がこのリクエストと一致しません。もう一度サインインしてください。
ko: 로그인 응답이 이번 요청과 일치하지 않습니다. 다시 로그인하십시오.
zh_hans: 登录响应与本次请求不符，请重新登录

source: 登入失敗：%@
en: Sign-in failed: %@
ja: サインインに失敗しました：%@
ko: 로그인에 실패했습니다: %@
zh_hans: 登录失败：%@

source: 移動
en: Move
ko: 이동
zh_hans: 移动

source: 移動項目
en: Move item
ja: 項目の移動
ko: 항목 이동
zh_hans: 移动项目

source: 純線上
en: Online Only
ja: オンラインのみ
ko: 온라인 전용
zh_hans: 仅在线

source: 組合網址
en: URL construction
ja: URLの組み立て
ko: URL 조합
zh_hans: 组合网址

source: 自動
en: Automatic
ko: 자동
zh_hans: 自动

source: 認證失敗，請檢查帳號與密碼
en: Authentication failed. Check the username and password.
ja: 認証に失敗しました。ユーザ名とパスワードを確認してください。
ko: 인증에 실패했습니다. 사용자 이름과 암호를 확인하십시오.
zh_hans: 认证失败，请检查用户名与密码

source: 請在路徑填入共用資料夾名稱
en: Enter the share name in the path
ja: パスに共有フォルダの名前を入力してください
ko: 경로에 공유 폴더 이름을 입력하세요
zh_hans: 请在路径中填入共享文件夹名称

source: 請設定一組密碼，加密備份不能沒有密碼
en: Set a passphrase: an encrypted backup cannot go without one
ja: パスワードを設定してください。暗号化バックアップにパスワードは必須です
ko: 암호를 설정하십시오. 암호화된 백업에는 암호가 필요합니다.
zh_hans: 请设置密码，加密备份必须有密码

source: 讀取屬性
en: Attribute read
ja: 属性の読み込み
ko: 속성 읽기
zh_hans: 读取属性

source: 讀取項目資訊
en: Item lookup
ja: 項目情報の取得
ko: 항목 정보 읽기
zh_hans: 读取项目信息

source: 路徑
en: Path
ja: パス
ko: 경로
zh_hans: 路径

source: 這不是 OpenSSH 私密金鑰檔案
en: This is not an OpenSSH private key file
ja: OpenSSH秘密鍵ファイルではありません
ko: OpenSSH 개인 키 파일이 아닙니다
zh_hans: 这不是 OpenSSH 私钥文件

source: 這份備份是較新版本（第 %@ 版，這個版本只讀到第 %@ 版）建立的，請先更新 Hamasen
en: This backup was made by a newer version (format %1$@, this build reads up to %2$@). Update Hamasen first.
ja: このバックアップは新しいバージョン（形式%1$@、このビルドは%2$@まで）で作成されています。先にHamasenを更新してください。
ko: 이 백업은 더 새로운 버전(형식 %1$@, 이 버전은 %2$@까지 읽을 수 있음)에서 만들어졌습니다. 먼저 Hamasen을 업데이트하십시오.
zh_hans: 这份备份由较新版本创建（第 %1$@ 版，此版本只能读取到第 %2$@ 版），请先更新 Hamasen

source: 這份加密備份使用這個版本不認得的加密方式
en: This encrypted backup uses an algorithm this version does not know
ja: この暗号化バックアップは、このバージョンが知らない方式を使っています
ko: 이 암호화된 백업은 이 버전에서 인식하지 못하는 암호화 방식을 사용합니다
zh_hans: 这份加密备份使用了此版本无法识别的加密方式

source: 這個檔案不是 Hamasen 的設定備份
en: This file is not a Hamasen settings backup
ja: このファイルはHamasenの設定バックアップではありません
ko: 이 파일은 Hamasen 설정 백업이 아닙니다
zh_hans: 这个文件不是 Hamasen 的设置备份

source: 這把 SSH 金鑰有密碼保護，請輸入金鑰密碼
en: This SSH key is protected. Enter its passphrase.
ja: このSSH鍵は保護されています。パスフレーズを入力してください。
ko: 이 SSH 키는 암호로 보호되어 있습니다. 키 암호를 입력하십시오.
zh_hans: 这个 SSH 密钥有密码保护，请输入密钥密码

source: 這是舊式 PEM 金鑰，請以 ssh-keygen -p -f <金鑰> 轉換為 OpenSSH 格式
en: This is a legacy PEM key. Convert it with ssh-keygen -p -f <key>.
ja: 旧形式のPEM鍵です。ssh-keygen -p -f <鍵> でOpenSSH形式に変換してください。
ko: 이전 형식의 PEM 키입니다. ssh-keygen -p -f <키> 명령으로 OpenSSH 형식으로 변환하십시오.
zh_hans: 这是旧式 PEM 密钥，请使用 ssh-keygen -p -f <密钥> 转换为 OpenSSH 格式

source: 連線
en: Connect
ja: 接続
ko: 연결
zh_hans: 连接

source: 連線逾時
en: Connection timed out
ja: 接続がタイムアウトしました
ko: 연결 시간이 초과되었습니다
zh_hans: 连接超时

source: 遠端已經有同名項目：%@
en: An item with this name already exists on the server: %@
ja: サーバに同じ名前の項目がすでにあります：%@
ko: 서버에 같은 이름의 항목이 이미 있습니다: %@
zh_hans: 服务器上已有同名项目：%@

source: 金鑰檔案內容損毀或格式不正確
en: The key file is damaged or malformed
ja: 鍵ファイルが破損しているか、形式が正しくありません
ko: 키 파일이 손상되었거나 형식이 올바르지 않습니다
zh_hans: 密钥文件已损坏或格式不正确
